{
    "Wie erstellt man ein mehrsprachiges Webseiten- oder Dokumentations-Projekt mit MkDocs, Material, und Langly?": {
        "__active__": true,
        "en-us": "How to create a multilingual website or documentation project with MkDocs, material, and Langly?"
    },
    "Für alle, die eine mehrsprachige Webseite erstellen möchten, bietet MkDocs in Kombination mit dem Material-Theme und dem Langly-Plugin eine hervorragende Lösung. In diesem Beitrag wird detailliert beschrieben, wie Sie eine internationale Webseite oder ein Dokumentationsprojekt mit MkDocs, Material und Langly erstellen können. Die Anleitung umfasst die Vorbereitung des Projekts, die Installation von MkDocs und Material sowie die anschließende Übersetzung der Inhalte mit Langly. Diese Schritt-für-Schritt-Anleitung richtet sich an Benutzer, die ein mehrsprachiges Web-Projekt erstellen möchten.": {
        "__active__": true,
        "en-us": "For anyone who wants to create a multilingual website, MkDocs in combination with the Material theme and the Langly plugin offers an excellent solution. This article describes in detail how you can create an international website or documentation project with MkDocs, Material and Langly. The guide covers preparing the project, installing MkDocs and Material and then translating the content with Langly. This step-by-step guide is aimed at users who want to create a multilingual web project."
    },
    "Im GitHub-Dashboard auf <code>New</code> klicken und schon geht der Spaß los.": {
        "__active__": true,
        "en-us": "Click on <code>New</code> in the GitHub dashboard and the fun begins."
    },
    "Einen beliebigen <code>Repository-Name</code> eingeben.": {
        "__active__": true,
        "en-us": "Enter any <code>Repository-Name</code>."
    },
    "Unter <code>Add .gitignore</code> bitte Python auswählen.": {
        "__active__": true,
        "en-us": "Under <code>Add .gitignore</code> please select Python."
    },
    "Und auf <code>Create Repository</code> klicken.": {
        "__active__": true,
        "en-us": "And click on <code>Create Repository</code>."
    },
    "Alle weiteren Felder sind für dieses Beispiel optional aber sollten natürlich auf die eigenen Bedürfnisse angepasst werden.": {
        "__active__": true,
        "en-us": "All other fields are optional for this example but should of course be adapted to your own requirements."
    },
    "Um das zuvor angelegte Repository zu klonen, navigiert man in VS Code zur <em>Quellcodeverwaltung</em> und dann auf <em>Repository klonen</em>. Nach dem Auswählen des Repository mit dem zuvor bei GitHub erstellten Namen, wird das Repository in das gewählte Arbeitsverzeichnis geklont.": {
        "__active__": true,
        "en-us": "To clone the previously created repository, navigate to <em>source code management</em> in VS Code and then to <em>Clone repository</em>. After selecting the repository with the name previously created on GitHub, the repository is cloned into the selected working directory."
    },
    "Voraussetzungen": {
        "__active__": true,
        "en-us": "Prerequisites"
    },
    "GitHub Repository erstellen": {
        "__active__": true,
        "en-us": "Create GitHub repository"
    },
    "Repository klonen": {
        "__active__": true,
        "en-us": "Clone repository"
    },
    "Virtuelles Python-Environment einrichten": {
        "__active__": true,
        "en-us": "Set up a virtual Python environment"
    },
    "Ist Python auf dem System installiert und die PATH Variable gesetzt ist die Einrichtung des <code>venv</code> sehr einfach. Man drückt in VS Code eigentlich nur die <code>F1</code>-Taste und wählt <em>Python: Umgebung erstellen...</em> aus.": {
        "__active__": true,
        "en-us": "If Python is installed on the system and the PATH variable is set, setting up the <code>venv</code> is very simple. You just press the <code>F1</code> in VS Code and select <em>Python: Create environment...</em> from."
    },
    "Boom! Da ist ein <code>venv</code>.": {
        "__active__": true,
        "en-us": "Boom! There's a <code>venv</code>."
    },
    "Regulär aktiviert Visual Studio Code das <code>venv</code> dann auch automatisch, wenn eine Python-Datei geöffnet wird aber in unserem Fall wird das <code>venv</code> erst einmal für die Installation von MkDocs und Material benötigt und es existiert keine Python-Datei im Projekt-Verzeichnis.": {
        "__active__": true,
        "en-us": "Visual Studio Code normally activates the <code>venv</code> automatically when a Python file is opened, but in our case the <code>venv</code> is first required for the installation of MkDocs and material and there is no Python file in the project directory."
    },
    "Also navigiert man über das integrierte Terminal im Projekt-Stammverzeichnis in das <code>.venv</code>-Verzeichnis und danach in das <code>Scripts</code>-Verzeichnis und führt dort <code>activate</code>aus.": {
        "__active__": true,
        "en-us": "So navigate via the integrated terminal in the project root directory to the <code>.venv</code> and then to the <code>Scripts</code> and <code>activate</code>there."
    },
    "Es sollte nun ein <code>(.venv)</code> vor dem Pfad im Terminal erscheinen.": {
        "__active__": true,
        "en-us": "A <code>(.venv)</code> should now appear in front of the path in the terminal."
    },
    "Weitere und detailliertere Informationen dazu gibt es auf dieser Webseite": {
        "__active__": true,
        "en-us": "Further and more detailed information can be found on this website"
    },
    "Um dieser Anleitung hier zu folgen werden einige Voraussetzungen benötigt. Prinzipiell sind abweichende Wege möglich aber um alles so einfach wie möglich zu halten, werden die hier gezeigten Schritte in Visual Studio Code durchgeführt.": {
        "__active__": true,
        "en-us": "In order to follow these instructions, some prerequisites are required. In principle, different ways are possible, but to keep everything as simple as possible, the steps shown here are carried out in Visual Studio Code."
    },
    "Einen GitHub-Account um das Web-Projekt später zu veröffentlichen.": {
        "__active__": true,
        "en-us": "A GitHub account to publish the web project later."
    },
    "Einen DeepL-Free oder höherwertigen Account.": {
        "__active__": true,
        "en-us": "A DeepL-Free or higher account."
    },
    "MkDocs einrichten": {
        "__active__": true,
        "en-us": "Set up MkDocs"
    },
    "Um MkDocs zu installieren wird im Terminal folgender Befehl ausgeführt.": {
        "__active__": true,
        "en-us": "To install MkDocs, execute the following command in the terminal."
    },
    "Nach dem alle Abhängigkeiten installiert wurden, müssen wir das Projekt noch erstellen. Dazu wird im Terminal folgender Befehl ausgeführt.": {
        "__active__": true,
        "en-us": "After all dependencies have been installed, we still need to create the project. To do this, the following command is executed in the terminal."
    },
    "Wenn alles geklappt hat, sollte im Browser unter <code>http://127.0.0.1:8000/</code> die MkDocs-Startseite erscheinen.": {
        "__active__": true,
        "en-us": "If everything went well, the MkDocs homepage should appear in the browser at <code>http://127.0.0.1:8000/</code>."
    },
    "Material-Theme einrichten": {
        "__active__": true,
        "en-us": "Set up material theme"
    },
    "Um das Material-Theme zu installieren wird im Terminal folgender Befehl ausgeführt.": {
        "__active__": true,
        "en-us": "To install the material theme, execute the following command in the terminal."
    },
    "Nach der Installation muss das Material-Theme noch in der <code>mkdocs.yml</code>-Konfigurationsdatei aktiviert werden. Dazu wird in der Datei folgender Eintrag hinzugefügt.": {
        "__active__": true,
        "en-us": "After installation, the material theme must be activated in the <code>mkdocs.yml</code> To do this, the following entry is added to the file."
    },
    "Beim nächsten <code>mkdocs serve</code> sollte dann auch das Material-Theme aktiviert sein.": {
        "__active__": true,
        "en-us": "The material theme should then also be activated with the next <code>mkdocs serve</code>."
    },
    "Langly-Plugin einrichten": {
        "__active__": true,
        "en-us": "Set up Langly plugin"
    },
    "Jetzt wird noch das Langly-Plugin installiert. Dazu wird im Terminal folgender Befehl ausgeführt.": {
        "__active__": true,
        "en-us": "Now install the Langly plugin. To do this, execute the following command in the terminal."
    },
    "Nach der Installation muss das Langly-Plugin in der <code>mkdocs.yml</code>-Konfigurationsdatei aktiviert und eingerichtet werden. Hierfür sind die Werte <code>source</code> und <code>targets</code> mit den gewünschten Sprachen auszufüllen. Die Quellsprache ist die Sprache, in der die Webseite oder Dokumentation erstellt wird, während die Zielsprachen die Sprachen sind, in die die Webseite oder Dokumentation übersetzt werden soll.": {
        "__active__": true,
        "en-us": "After installation, the Langly plugin must be activated and set up in the <code>mkdocs.yml</code>. To do this, the <code>source</code> and <code>targets</code> values must be filled in with the desired languages. The source language is the language in which the website or documentation is created, while the target languages are the languages into which the website or documentation is to be translated."
    },
    "Wichtig ist, dass das Langly-Plugin in der Reihenfolge der Plugins als <strong>letztes</strong> aufgeführt wird.": {
        "__active__": true,
        "en-us": "It is important that the Langly plugin is listed <strong>last</strong> in the order of the plugins."
    },
    "Die hier gewählten Sprachen sind nur Beispielhaft und können selbstverständliche auf das eigene Vorhaben angepasst werden.": {
        "__active__": true,
        "en-us": "The languages selected here are only examples and can of course be adapted to your own project."
    },
    "Jetzt wird der DeepL-Api-Key benötigt. Diesen erhält man, indem man ein DeepL-Free-Konto erstellt. Sobald der Api-Key generiert wurde, wird eine Datei mit dem Namen <code>auth_key.json</code> im Hauptverzeichnis des Projekts angelegt und der Api-Key dort eingetragen.": {
        "__active__": true,
        "en-us": "The DeepL API key is now required. This can be obtained by creating a DeepL free account. As soon as the api key has been generated, a file with the name <code>auth_key.json</code> is created in the main directory of the project and the api key is entered there."
    },
    "Diese sieht im Augenblick so aus.": {
        "__active__": true,
        "en-us": "This looks like this at the moment."
    },
    "In unserem Beispiel wäre dies dann am sinnvollsten.": {
        "__active__": true,
        "en-us": "In our example, this would make the most sense."
    },
    "Bei der nächsten Ausführung von <code>mkdocs serve</code> werden alle maskierten Texte automatisch übersetzt, die Delimiter entfernt und die Quell- sowie Zielsprache korrekt auf der Seite angezeigt. Das Sprachmenü ermöglicht es dann, zu den einzelnen Sprachversionen zu navigieren.": {
        "__active__": true,
        "en-us": "The next time <code>mkdocs serve</code> is executed, all masked texts are automatically translated, the delimiters are removed and the source and target languages are displayed correctly on the page. The language menu then allows you to navigate to the individual language versions."
    },
    "DeepL-Api-Key bereitstellen und schützen": {
        "__active__": true,
        "en-us": "Provide and protect DeepL api key"
    },
    "Übersetzung starten": {
        "__active__": true,
        "en-us": "Start translation"
    },
    "Übersetzung manuell verfeinern": {
        "__active__": true,
        "en-us": "Manually refine the translation"
    },
    "Probieren wir es einfach an der <code>index.md</code>-Datei aus, die sich im <code>docs</code> Verzeichnis im Projekt befindet.": {
        "__active__": true,
        "en-us": "Let's just try it out on the <code>index.md</code>, which is located in the <code>docs</code> directory in the project."
    },
    "Eine einfache Maskierung ist völlig ausreichend. Fokussieren Sie sich auf die spezifischen Texte, die übersetzt werden müssen, und vermeiden Sie übermäßige Maskierung. Das bedeutet, dass Sie lediglich die relevanten Textteile mit den Maskierungszeichen <code>{[</code> und <code>]}</code> umschließen sollten, um eine präzisere Übersetzung zu ermöglichen. Bei mehreren Sätzen sollte selbstverständlich der gesamte Abschnitt maskiert werden, damit DeepL den Kontext besser erfassen kann.": {
        "__active__": true,
        "en-us": "Simple masking is completely sufficient. Focus on the specific texts that need to be translated and avoid excessive masking. This means that you should only enclose the relevant parts of the text with the masking characters <code>{[</code> and <code>]}</code> to enable a more precise translation. If there are several sentences, the entire section should of course be masked so that DeepL can better understand the context."
    },
    "Jeder Datensatz beinhaltet den Sprachschlüssel als Attributnamen, während der übersetzte Text im untergeordneten Attribut <code>de</code> als Wert dargestellt wird. Solange der Sprachschlüssel konstant bleibt, wird Langly immer den Text des <code>de</code>-Attributs in diesem Beispiel nutzen. Sollte der Sprachschlüssel versehentlich verändert werden, kann Langly die Zuordnung nicht mehr korrekt durchführen, was dazu führt, dass die Übersetzung erneut vorgenommen wird und der manipulierte Datensatz entfernt wird.": {
        "__active__": true,
        "en-us": "Each data record contains the language key as an attribute name, while the translated text is displayed as a value in the subordinate <code>de</code> attribute. As long as the language key remains constant, Langly will always use the text of the <code>de</code> in this example. If the language key is accidentally changed, Langly can no longer carry out the assignment correctly, which results in the translation being carried out again and the manipulated data record being removed."
    },
    "Das <code>__active__</code>-Attribut wird von Langly genutzt, um festzustellen, ob der Datensatz weiterhin benötigt wird, und entfernt ihn bei der nächsten Ausführung.": {
        "__active__": true,
        "en-us": "The <code>__active__</code> is used by Langly to determine whether the data set is still required and removes it the next time it is executed."
    },
    "Jetzt sind wir im Grunde genommen bereit, mit der Übersetzung zu beginnen. Um dies zu erreichen, wird der zu übersetzende Inhalt in den Markdown-Dateien einfach maskiert, und das Langly-Plugin übernimmt den Rest. Die Maskierung erfolgt, indem der zu übersetzende Text mit <code>{[</code> und <code>]}</code> umschlossen wird.": {
        "__active__": true,
        "en-us": "Now we are basically ready to start translating. To achieve this, the content to be translated in the Markdown files is simply masked and the Langly plugin takes care of the rest. The masking is done by enclosing the text to be translated with <code>{[</code> and <code>]}</code>."
    },
    "Jetzt folgt der Test. Dazu führen wir den <code>serve</code>-Befehl erneut aus.": {
        "__active__": true,
        "en-us": "Now comes the test. To do this, we execute the <code>serve</code> again."
    },
    "Im folgenden Dialog wählt man <em>Venv</em> und danach den Interpreter-Pfad der installierten oder bevorzugten Python-Version.": {
        "__active__": true,
        "en-us": "In the following dialog, select <em>Venv</em> and then the interpreter path of the installed or preferred Python version."
    },
    "Fazit": {
        "__active__": true,
        "en-us": "Conclusion"
    },
    "Das war es auch schon. Viel Spaß beim Erstellen Ihrer mehrsprachigen Webseite oder Dokumentation mit MkDocs, Material und Langly.": {
        "__active__": true,
        "en-us": "That's all there is to it. Have fun creating your multilingual website or documentation with MkDocs, Material and Langly."
    },
    "Viel Erfolg!": {
        "__active__": true,
        "en-us": "Good luck!"
    },
    "Bevor wir starten, möchte ich Sie eindringlich bitten, den Punkt <strong>DeepL-Api-Key bereitstellen und schützen</strong> besonders zu beachten. Es ist wichtig, dass die Datei <code>auth_key.json</code> in der <code>.gitignore</code> ausgeschlossen wird, um den Api-Key zu schützen und die Sicherheit Ihrer Daten zu gewährleisten.": {
        "__active__": true,
        "en-us": "Before we start, I would like to urge you to pay special attention to the point <strong>DeepL-Api-Key provide and protect</strong>. It is important that the <code>auth_key.json</code> file in the <code>.gitignore</code> is excluded in order to protect the Api key and ensure the security of your data."
    },
    "Bitte den Api-Key in der <code>.gitignore</code> ausschließen und auch auf jede erdenkliche Weise vor dem Upload ins Internet schützen.": {
        "__active__": true,
        "en-us": "Please exclude the Api key in the <code>.gitignore</code> and protect it in every possible way from being uploaded to the Internet."
    },
    "Falls die automatische Übersetzung unzureichend ist oder bestimmte Zeichen oder Formatierungen nicht richtig übersetzt wurden, besteht die Möglichkeit, die entsprechenden JSON-Dateien im Verzeichnis <code>locales</code> im Hauptverzeichnis des Projekts zu bearbeiten.": {
        "__active__": true,
        "en-us": "If the automatic translation is insufficient or certain characters or formatting have not been translated correctly, it is possible to edit the corresponding JSON files in the <code>locales</code> directory in the main directory of the project."
    },
    "Der Inhalt der <code>index.json</code> der deutschen Sprachvariante sieht jetzt so aus.": {
        "__active__": true,
        "en-us": "The content of the <code>index.json</code> of the German language version now looks like this."
    },
    "Solange der <code>serve</code>-Modus aktiviert ist, werden sämtliche Übersetzungen als Entwurf angezeigt, um den Zugriff auf die Übersetzungs-Api zu reduzieren. Wenn <code>serve</code>, <code>build</code> oder <code>gh-dploy</code> erneut aufgerufen werden, werden die Übersetzungen fortgesetzt und die Entwürfe entfernt.": {
        "__active__": true,
        "en-us": "As long as <code>serve</code> is activated, all translations are displayed as drafts in order to reduce access to the translation api. If <code>serve</code>, <code>build</code> or <code>gh-dploy</code> are called again, the translations are continued and the drafts are removed."
    },
    "Python und Git müssen auf dem System installiert sein": {
        "__active__": true,
        "en-us": "Python and Git must be installed on the system"
    },
    "Visual Studio Code und die benötigten Erweiterungen für die Arbeit mit Python": {
        "__active__": true,
        "en-us": "Visual Studio Code and the required extensions for working with Python"
    },
    "Los geht’s": {
        "__active__": true,
        "en-us": "Here we go"
    },
    "Da später die Webseite oder Dokumentation im Internet (GH-Pages) veröffentlicht werden soll, wird ein GitHub-Repository benötigt. Man kann dieses über die GitHub-Webseite erstellen, was sich empfiehlt, da so auch gleich eine <code>.gitignore</code>-Datei erstellt werden kann, die für dieses HowTo auch zwingend benötigt wird.": {
        "__active__": true,
        "en-us": "As the website or documentation is to be published on the Internet (GH pages) later, a GitHub repository is required. You can create this via the GitHub website, which is recommended, as this also allows you to create a <code>.gitignore</code>, which is also absolutely necessary for this HowTo."
    },
    "Um das zu erreichen wird eine neue Zeile ans Ende der <code>.gitignore</code> hinzugefügt. Da wir sie beim Erstellen des Repositorys bei GitHub bereits angelegt haben, kann sie jetzt einfach geöffnet und bearbeitet werden.": {
        "__active__": true,
        "en-us": "To achieve this, a new line is added to the end of the <code>.gitignore</code>. As we have already created it when creating the repository at GitHub, it can now be easily opened and edited."
    },
    "Ab diesem Punkt kann den Dokumentationen und HowTo’s von MkDocs oder Material gefolgt werden, um Ihre Webseite weiter auszubauen. Das Langly-Plugin wird die Übersetzung der maskierten Texte automatisch übernehmen.": {
        "__active__": true,
        "en-us": "From this point on, you can follow the documentation and HowTo's from MkDocs or Material to further expand your website. The Langly plugin will automatically translate the masked texts."
    }
}