{
    "Verteilung von Autodesk-Software mit ODIS-Installer und PowerShell unter Vermeidung des Double-Hop-Problems": {
        "__active__": true,
        "ru": "Распространение программного обеспечения Autodesk с помощью программы установки ODIS и PowerShell, позволяющей избежать проблемы двойного хопа"
    },
    "Seitdem Autodesk sein Deployment-System auf den ODIS-Installer umgestellt hat, laufen alle Verteilungen, die unbeaufsichtigt über den SYSTEM-Account ausgerollt werden, ohne Erfolgscode endlos weiter.": {
        "__active__": true,
        "ru": "С тех пор как компания Autodesk перевела свою систему развертывания на программу установки ODIS, все развертывания, выполняемые без присмотра через учетную запись SYSTEM, продолжают бесконечно выполняться без кода успеха."
    },
    "Die genaue Fehlermeldung im ODIS-Log lautet:": {
        "__active__": true,
        "ru": "Точное сообщение об ошибке в журнале ODIS следующее:"
    },
    "Nach einer Weile scheint der Installer-Dienst auch beendet zu werden, sendet aber keinen Exit-Code mehr.": {
        "__active__": true,
        "ru": "Через некоторое время служба установщика также завершается, но больше не отправляет код выхода."
    },
    "Ich habe viele Deployment-Suiten ausprobiert, aber das Resultat ist immer dasselbe, wenn der SYSTEM-Account zum Einsatz kommt.": {
        "__active__": true,
        "ru": "Я перепробовал множество наборов развертывания, но результат всегда один и тот же, когда используется учетная запись SYSTEM."
    },
    "Um das Problem vorübergehend zu lösen, bis Autodesk das Problem erkennt und behebt, habe ich nun Lösungsansätze entwickelt, die mir hier bei der Arbeit Abhilfe verschaffen.": {
        "__active__": true,
        "ru": "Чтобы временно решить проблему, пока Autodesk не признает и не устранит ее, я разработал решения, которые помогают мне в работе."
    },
    "Mein geplanter Ansatz war, die Verteilung über PowerShell zu realisieren, aber dabei stieß ich erneut auf eine weitere Hürde, die die Kerberos-Authentifizierung mit sich bringt: das sogenannte Double-Hop-Problem, da meine Softwarepakete in CIFS-Freigaben lagern.": {
        "__active__": true,
        "ru": "Я планировал реализовать дистрибутив с помощью PowerShell, но столкнулся с еще одним препятствием, которое несет с собой аутентификация Kerberos: так называемой проблемой двойного хопа, поскольку мои программные пакеты хранятся в общих ресурсах CIFS."
    },
    "Kerberos lässt es nicht zu, dass nach einer Authentifizierung auf einem Remote-PC eine weitere Authentifizierung über diesen Endpunkt zu anderen entfernten Zielen durchgeführt wird. Es gibt also keinen zweiten Hop. Um das Problem zu umgehen, gibt es wenige, aber komplizierte Wege oder einen, bei dem jetzt alle sagen werden: \"Oh mein Gott, tu das nicht\", aber ich hau es einfach mal raus.": {
        "__active__": true,
        "ru": "Kerberos не позволяет проводить дальнейшую аутентификацию через эту конечную точку в других удаленных точках после аутентификации на удаленном ПК. Таким образом, второго хопа нет. Чтобы обойти эту проблему, есть несколько сложных способов или один, о котором все сейчас скажут: \"О боже, не делайте этого\", но я просто выложу его здесь."
    },
    "Die Lösung ist, CredSSP nur temporär als Punkt-zu-Punkt-Verbindung zu nutzen und nach dem Deployment wieder zu entschärfen. Es sollte unter keinen Umständen unternehmensweit erlaubt werden.": {
        "__active__": true,
        "ru": "Решение состоит в том, чтобы временно использовать CredSSP в качестве соединения \"точка-точка\", а после развертывания снова отключить его. Ни в коем случае нельзя разрешать его использование в масштабах всей компании."
    },
    "CredSSP hat keinen Single-Hop-Zwang. Authentifizierungen können in einer CredSSP-Sitzung weiterverwendet werden. Sollte das unternehmensweit und dauerhaft erlaubt werden, kann das zu erheblichen Sicherheitsproblemen führen.": {
        "__active__": true,
        "ru": "CredSSP не имеет ограничений по одному хопу. Аутентификация может продолжать использоваться в сеансе CredSSP. Если это будет разрешено в масштабах всей компании и на постоянной основе, это может привести к серьезным проблемам безопасности."
    },
    "Hier nun das Skript für alle, die vor dem selben Problem stehen.": {
        "__active__": true,
        "ru": "Вот сценарий для всех, кто столкнулся с той же проблемой."
    },
    "Das hier beschriebene Skript ist bewusst flach gehalten, um es verständlich zu machen und den weiteren Ausbau durch Euch so einfach wie möglich zu gestalten.": {
        "__active__": true,
        "ru": "Описанный здесь скрипт намеренно сделан плоским, чтобы сделать его понятным и максимально упростить дальнейшее расширение с вашей стороны."
    },
    "Bitte beachten Sie, dass in diesem Beispiel CredSSP nur temporär verwendet wird und nach dem Deployment wieder deaktiviert wird. Zudem wird ausschließlich der angegebene Remote-Computer delegiert und nicht das gesamte Netzwerk.": {
        "__active__": true,
        "ru": "Обратите внимание, что CredSSP в этом примере используется только временно и после развертывания снова отключается. Кроме того, делегируется только указанный удаленный компьютер, а не вся сеть."
    },
    "Nach gründlicher Validierung hat sich dieser Ansatz als sicherer und einfacher Weg erwiesen, um das gewünschte Ziel zu erreichen.": {
        "__active__": true,
        "ru": "После тщательной проверки этот подход оказался безопасным и простым способом достижения желаемой цели."
    },
    "Dieses Skript muss mit administrativen Rechten ausgeführt werden, um die CredSSP-Authentifizierung zu aktivieren und zu deaktivieren.": {
        "__active__": true,
        "ru": "Этот сценарий должен выполняться с правами администратора, чтобы активировать и деактивировать аутентификацию CredSSP."
    },
    "Die Parameter für die Silent-Installation und Deinstallation sind ebenfalls dort hinterlegt. Diese Parameter ermöglichen eine unbeaufsichtigte Installation bzw. Deinstallation der Software, was besonders in großen IT-Umgebungen von Vorteil ist.": {
        "__active__": true,
        "ru": "Там же хранятся параметры для бесшумной установки и удаления. Эти параметры позволяют устанавливать и удалять программное обеспечение без присмотра, что особенно удобно в больших ИТ-средах."
    },
    "Für weitere Details und eine ausführliche Anleitung zur Bereitstellung von Autodesk-Software, besuchen Sie bitte den folgenden Artikel:": {
        "__active__": true,
        "ru": "Более подробную информацию и подробные инструкции по развертыванию программного обеспечения Autodesk можно найти в следующей статье:"
    },
    "Um eine PowerShell-Sitzung unter Verwendung von CredSSP zu starten, benötigen wir die Anmeldeinformationen eines Benutzers mit den erforderlichen Rechten zur Durchführung von Installationen. In den meisten Fällen handelt es sich dabei um den Domain-Admin. Ein Dialogfeld wird angezeigt, in dem Sie die Anmeldeinformationen eingeben können.": {
        "__active__": true,
        "ru": "Чтобы запустить сеанс PowerShell с помощью CredSSP, нам нужны учетные данные пользователя с правами, необходимыми для выполнения установки. В большинстве случаев это администратор домена. Появится диалоговое окно, в котором можно ввести данные для входа в систему."
    },
    "Hier wird CredSSP sowohl auf dem Client als auch auf dem Server aktiviert. Es ist hilfreich, die Begriffe \"Verteiler\" (Client) und \"Empfänger\" (Server) zu verwenden, um die Rollen klarer zu definieren. Der Try-Block umfasst alle potenziell fehleranfälligen Aktionen und kann nach Belieben angepasst werden. Für den Anfang ist diese Struktur einfach und robust.": {
        "__active__": true,
        "ru": "Здесь CredSSP активирован как на клиенте, так и на сервере. Для более четкого определения ролей полезно использовать термины \"распространитель\" (клиент) и \"получатель\" (сервер). Блок попыток включает все потенциально опасные действия, которые могут привести к ошибкам, и может быть настроен по мере необходимости. Для начала эта структура проста и надежна."
    },
    "Hier wird eine neue PowerShell-Sitzung mit CredSSP-Authentifizierung erstellt.": {
        "__active__": true,
        "ru": "Здесь создается новый сеанс PowerShell с аутентификацией CredSSP."
    },
    "Hier wird das Skript auf dem Remote-Computer ausgeführt. Der Name, der Installer und die Argumente werden als Parameter übergeben. An dieser Stelle endet der Try-Block.": {
        "__active__": true,
        "ru": "Здесь сценарий выполняется на удаленном компьютере. В качестве параметров передаются имя, программа установки и аргументы. На этом блок попыток заканчивается."
    },
    "Im Finally-Block wird die PowerShell-Sitzung geschlossen und CredSSP auf dem Server und Client deaktiviert. Der Finally-Block wird immer ausgeführt, unabhängig davon, ob der Try-Block erfolgreich war oder nicht. Bitte beachten Sie, dass das Abfangen von Fehlern auch über einen möglichen Exception-Block erfolgen kann. Dies überlasse ich dem findigen Leser.": {
        "__active__": true,
        "ru": "Блок Finally закрывает сеанс PowerShell и деактивирует CredSSP на сервере и клиенте. Блок Finally выполняется всегда, независимо от того, был ли блок Try успешным или нет. Обратите внимание, что ошибки также можно перехватывать с помощью блока исключений. Я оставляю это на усмотрение находчивого читателя."
    },
    "Dieses Skript dient mir nun selbst als Grundlage für Erweiterungen. Ich werde nun daran arbeiten, ein übergeordnetes Skript zu entwickeln, um die Installationen in großen Mengen zu steuern und zu überwachen.": {
        "__active__": true,
        "ru": "Этот скрипт теперь служит основой для моих собственных расширений. Теперь я буду работать над созданием главного скрипта для управления и мониторинга установок в больших количествах."
    },
    "Quellangaben": {
        "__active__": true,
        "ru": "Источник информации"
    },
    "Das Skript kann entweder mit Parametern aufgerufen werden, oder Sie tragen Ihre spezifischen Werte direkt ein. Die notwendigen Informationen für den Installer und die Argumente finden Sie nach der Image-Erstellung im entsprechenden Installations-Skript. Ein typischer Name für eine Revit-Installation könnte beispielsweise <code>Install Autodesk Revit 2024.bat</code> sein.": {
        "__active__": true,
        "ru": "Сценарий может быть вызван с параметрами или вы можете ввести свои значения напрямую. Необходимую информацию для программы установки и аргументы можно найти в соответствующем сценарии установки после создания образа. Типичное имя для установки Revit может быть, например, <code>Install Autodesk Revit 2024.bat</code>."
    }
}