{
    "Verteilung von Autodesk-Software mit ODIS-Installer und PowerShell unter Vermeidung des Double-Hop-Problems": {
        "__active__": true,
        "fr": "Distribution de logiciels Autodesk avec le programme d'installation ODIS et PowerShell en évitant le problème du double saut"
    },
    "Seitdem Autodesk sein Deployment-System auf den ODIS-Installer umgestellt hat, laufen alle Verteilungen, die unbeaufsichtigt über den SYSTEM-Account ausgerollt werden, ohne Erfolgscode endlos weiter.": {
        "__active__": true,
        "fr": "Depuis qu'Autodesk a changé son système de déploiement pour l'installateur ODIS, toutes les distributions déployées sans surveillance via le compte SYSTEM se poursuivent indéfiniment sans code de réussite."
    },
    "Die genaue Fehlermeldung im ODIS-Log lautet:": {
        "__active__": true,
        "fr": "Le message d'erreur exact dans le journal ODIS est le suivant :"
    },
    "Nach einer Weile scheint der Installer-Dienst auch beendet zu werden, sendet aber keinen Exit-Code mehr.": {
        "__active__": true,
        "fr": "Après un certain temps, le service d'installation semble également se terminer, mais n'envoie plus de code de sortie."
    },
    "Ich habe viele Deployment-Suiten ausprobiert, aber das Resultat ist immer dasselbe, wenn der SYSTEM-Account zum Einsatz kommt.": {
        "__active__": true,
        "fr": "J'ai essayé de nombreuses suites de déploiement, mais le résultat est toujours le même lorsque le compte SYSTEM est utilisé."
    },
    "Um das Problem vorübergehend zu lösen, bis Autodesk das Problem erkennt und behebt, habe ich nun Lösungsansätze entwickelt, die mir hier bei der Arbeit Abhilfe verschaffen.": {
        "__active__": true,
        "fr": "Pour résoudre temporairement le problème jusqu'à ce qu'Autodesk le reconnaisse et le corrige, j'ai maintenant développé des approches de solution qui me soulagent ici dans mon travail."
    },
    "Mein geplanter Ansatz war, die Verteilung über PowerShell zu realisieren, aber dabei stieß ich erneut auf eine weitere Hürde, die die Kerberos-Authentifizierung mit sich bringt: das sogenannte Double-Hop-Problem, da meine Softwarepakete in CIFS-Freigaben lagern.": {
        "__active__": true,
        "fr": "Mon approche prévue était de réaliser la distribution via PowerShell, mais je me suis à nouveau heurté à un autre obstacle lié à l'authentification Kerberos : le problème dit de double saut, car mes paquets logiciels sont stockés dans des partages CIFS."
    },
    "Kerberos lässt es nicht zu, dass nach einer Authentifizierung auf einem Remote-PC eine weitere Authentifizierung über diesen Endpunkt zu anderen entfernten Zielen durchgeführt wird. Es gibt also keinen zweiten Hop. Um das Problem zu umgehen, gibt es wenige, aber komplizierte Wege oder einen, bei dem jetzt alle sagen werden: \"Oh mein Gott, tu das nicht\", aber ich hau es einfach mal raus.": {
        "__active__": true,
        "fr": "Kerberos ne permet pas qu'après une authentification sur un PC distant, une autre authentification soit effectuée via ce point final vers d'autres destinations distantes. Il n'y a donc pas de deuxième saut. Pour contourner le problème, il existe des moyens peu nombreux mais compliqués ou un moyen pour lequel tout le monde va dire : \"Oh mon Dieu, ne fais pas ça\", mais je vais juste le sortir."
    },
    "Die Lösung ist, CredSSP nur temporär als Punkt-zu-Punkt-Verbindung zu nutzen und nach dem Deployment wieder zu entschärfen. Es sollte unter keinen Umständen unternehmensweit erlaubt werden.": {
        "__active__": true,
        "fr": "La solution consiste à n'utiliser CredSSP que temporairement comme connexion point à point et à le désamorcer après le déploiement. Il ne devrait en aucun cas être autorisé à l'échelle de l'entreprise."
    },
    "CredSSP hat keinen Single-Hop-Zwang. Authentifizierungen können in einer CredSSP-Sitzung weiterverwendet werden. Sollte das unternehmensweit und dauerhaft erlaubt werden, kann das zu erheblichen Sicherheitsproblemen führen.": {
        "__active__": true,
        "fr": "CredSSP n'a pas de contrainte de saut unique. Les authentifications peuvent être réutilisées dans une session CredSSP. Si cela devait être autorisé à l'échelle de l'entreprise et de manière permanente, cela pourrait entraîner des problèmes de sécurité importants."
    },
    "Hier nun das Skript für alle, die vor dem selben Problem stehen.": {
        "__active__": true,
        "fr": "Voici maintenant le script pour tous ceux qui sont confrontés au même problème."
    },
    "Das hier beschriebene Skript ist bewusst flach gehalten, um es verständlich zu machen und den weiteren Ausbau durch Euch so einfach wie möglich zu gestalten.": {
        "__active__": true,
        "fr": "Le script décrit ici est volontairement plat afin de le rendre compréhensible et de faciliter au maximum son développement ultérieur par vos soins."
    },
    "Bitte beachten Sie, dass in diesem Beispiel CredSSP nur temporär verwendet wird und nach dem Deployment wieder deaktiviert wird. Zudem wird ausschließlich der angegebene Remote-Computer delegiert und nicht das gesamte Netzwerk.": {
        "__active__": true,
        "fr": "Veuillez noter que dans cet exemple, CredSSP n'est utilisé que temporairement et sera désactivé après le déploiement. De plus, seul l'ordinateur distant indiqué est délégué et non l'ensemble du réseau."
    },
    "Nach gründlicher Validierung hat sich dieser Ansatz als sicherer und einfacher Weg erwiesen, um das gewünschte Ziel zu erreichen.": {
        "__active__": true,
        "fr": "Après une validation approfondie, cette approche s'est avérée être un moyen sûr et simple d'atteindre l'objectif souhaité."
    },
    "Dieses Skript muss mit administrativen Rechten ausgeführt werden, um die CredSSP-Authentifizierung zu aktivieren und zu deaktivieren.": {
        "__active__": true,
        "fr": "Ce script doit être exécuté avec des droits d'administration pour activer et désactiver l'authentification CredSSP."
    },
    "Die Parameter für die Silent-Installation und Deinstallation sind ebenfalls dort hinterlegt. Diese Parameter ermöglichen eine unbeaufsichtigte Installation bzw. Deinstallation der Software, was besonders in großen IT-Umgebungen von Vorteil ist.": {
        "__active__": true,
        "fr": "Les paramètres d'installation et de désinstallation silencieuses y sont également consignés. Ces paramètres permettent d'installer ou de désinstaller le logiciel sans surveillance, ce qui est particulièrement avantageux dans les grands environnements informatiques."
    },
    "Für weitere Details und eine ausführliche Anleitung zur Bereitstellung von Autodesk-Software, besuchen Sie bitte den folgenden Artikel:": {
        "__active__": true,
        "fr": "Pour plus de détails et des instructions détaillées sur le déploiement des logiciels Autodesk, veuillez consulter l'article suivant :"
    },
    "Um eine PowerShell-Sitzung unter Verwendung von CredSSP zu starten, benötigen wir die Anmeldeinformationen eines Benutzers mit den erforderlichen Rechten zur Durchführung von Installationen. In den meisten Fällen handelt es sich dabei um den Domain-Admin. Ein Dialogfeld wird angezeigt, in dem Sie die Anmeldeinformationen eingeben können.": {
        "__active__": true,
        "fr": "Pour lancer une session PowerShell à l'aide de CredSSP, nous avons besoin des informations de connexion d'un utilisateur disposant des droits nécessaires pour effectuer des installations. Dans la plupart des cas, il s'agit de l'administrateur du domaine. Une boîte de dialogue s'affiche, dans laquelle vous pouvez saisir les informations d'identification."
    },
    "Hier wird CredSSP sowohl auf dem Client als auch auf dem Server aktiviert. Es ist hilfreich, die Begriffe \"Verteiler\" (Client) und \"Empfänger\" (Server) zu verwenden, um die Rollen klarer zu definieren. Der Try-Block umfasst alle potenziell fehleranfälligen Aktionen und kann nach Belieben angepasst werden. Für den Anfang ist diese Struktur einfach und robust.": {
        "__active__": true,
        "fr": "Ici, CredSSP est activé à la fois sur le client et sur le serveur. Il est utile d'utiliser les termes \"distributeur\" (client) et \"récepteur\" (serveur) pour définir plus clairement les rôles. Le bloc Try comprend toutes les actions potentiellement sujettes à des erreurs et peut être adapté à volonté. Pour commencer, cette structure est simple et robuste."
    },
    "Hier wird eine neue PowerShell-Sitzung mit CredSSP-Authentifizierung erstellt.": {
        "__active__": true,
        "fr": "Ici, une nouvelle session PowerShell est créée avec une authentification CredSSP."
    },
    "Hier wird das Skript auf dem Remote-Computer ausgeführt. Der Name, der Installer und die Argumente werden als Parameter übergeben. An dieser Stelle endet der Try-Block.": {
        "__active__": true,
        "fr": "Ici, le script est exécuté sur l'ordinateur distant. Le nom, l'installateur et les arguments sont passés en paramètres. Le bloc try se termine à cet endroit."
    },
    "Im Finally-Block wird die PowerShell-Sitzung geschlossen und CredSSP auf dem Server und Client deaktiviert. Der Finally-Block wird immer ausgeführt, unabhängig davon, ob der Try-Block erfolgreich war oder nicht. Bitte beachten Sie, dass das Abfangen von Fehlern auch über einen möglichen Exception-Block erfolgen kann. Dies überlasse ich dem findigen Leser.": {
        "__active__": true,
        "fr": "Dans le bloc Finally, la session PowerShell est fermée et CredSSP est désactivé sur le serveur et le client. Le bloc Finally est toujours exécuté, que le bloc Try ait réussi ou non. Veuillez noter que l'interception d'erreurs peut également se faire via un éventuel bloc d'exception. Je laisse ce soin au lecteur ingénieux."
    },
    "Dieses Skript dient mir nun selbst als Grundlage für Erweiterungen. Ich werde nun daran arbeiten, ein übergeordnetes Skript zu entwickeln, um die Installationen in großen Mengen zu steuern und zu überwachen.": {
        "__active__": true,
        "fr": "Ce script me sert maintenant lui-même de base pour des extensions. Je vais maintenant travailler à la mise au point d'un script de niveau supérieur pour contrôler et surveiller les installations en grand nombre."
    },
    "Quellangaben": {
        "__active__": true,
        "fr": "Citations de sources"
    },
    "Das Skript kann entweder mit Parametern aufgerufen werden, oder Sie tragen Ihre spezifischen Werte direkt ein. Die notwendigen Informationen für den Installer und die Argumente finden Sie nach der Image-Erstellung im entsprechenden Installations-Skript. Ein typischer Name für eine Revit-Installation könnte beispielsweise <code>Install Autodesk Revit 2024.bat</code> sein.": {
        "__active__": true,
        "fr": "Vous pouvez soit appeler le script avec des paramètres, soit saisir directement vos valeurs spécifiques. Vous trouverez les informations nécessaires pour l'installateur et les arguments dans le script d'installation correspondant après la création de l'image. Un nom typique pour une installation Revit pourrait par exemple être <code>Install Autodesk Revit 2024.bat</code>."
    }
}