{
    "Verteilung von Autodesk-Software mit ODIS-Installer und PowerShell unter Vermeidung des Double-Hop-Problems": {
        "__active__": true,
        "es": "Distribución de software de Autodesk con el instalador ODIS y PowerShell evitando el problema del doble salto"
    },
    "Seitdem Autodesk sein Deployment-System auf den ODIS-Installer umgestellt hat, laufen alle Verteilungen, die unbeaufsichtigt über den SYSTEM-Account ausgerollt werden, ohne Erfolgscode endlos weiter.": {
        "__active__": true,
        "es": "Desde que Autodesk cambió su sistema de despliegue al instalador ODIS, todos los despliegues desatendidos a través de la cuenta SYSTEM siguen ejecutándose sin fin y sin código de éxito."
    },
    "Die genaue Fehlermeldung im ODIS-Log lautet:": {
        "__active__": true,
        "es": "El mensaje de error exacto en el registro ODIS dice:"
    },
    "Nach einer Weile scheint der Installer-Dienst auch beendet zu werden, sendet aber keinen Exit-Code mehr.": {
        "__active__": true,
        "es": "Al cabo de un rato, el servicio de instalación también parece terminar, pero ya no envía un código de salida."
    },
    "Ich habe viele Deployment-Suiten ausprobiert, aber das Resultat ist immer dasselbe, wenn der SYSTEM-Account zum Einsatz kommt.": {
        "__active__": true,
        "es": "He probado muchas suites de despliegue, pero el resultado es siempre el mismo cuando se utiliza la cuenta SYSTEM."
    },
    "Um das Problem vorübergehend zu lösen, bis Autodesk das Problem erkennt und behebt, habe ich nun Lösungsansätze entwickelt, die mir hier bei der Arbeit Abhilfe verschaffen.": {
        "__active__": true,
        "es": "Para resolver el problema temporalmente hasta que Autodesk reconozca y solucione el problema, ahora he desarrollado soluciones que me ayudan aquí en el trabajo."
    },
    "Mein geplanter Ansatz war, die Verteilung über PowerShell zu realisieren, aber dabei stieß ich erneut auf eine weitere Hürde, die die Kerberos-Authentifizierung mit sich bringt: das sogenannte Double-Hop-Problem, da meine Softwarepakete in CIFS-Freigaben lagern.": {
        "__active__": true,
        "es": "Mi planteamiento previsto era realizar la distribución a través de PowerShell, pero me topé con otro obstáculo que conlleva la autenticación Kerberos: el llamado problema del doble salto, ya que mis paquetes de software se almacenan en recursos compartidos CIFS."
    },
    "Kerberos lässt es nicht zu, dass nach einer Authentifizierung auf einem Remote-PC eine weitere Authentifizierung über diesen Endpunkt zu anderen entfernten Zielen durchgeführt wird. Es gibt also keinen zweiten Hop. Um das Problem zu umgehen, gibt es wenige, aber komplizierte Wege oder einen, bei dem jetzt alle sagen werden: \"Oh mein Gott, tu das nicht\", aber ich hau es einfach mal raus.": {
        "__active__": true,
        "es": "Kerberos no permite que se lleve a cabo una autenticación posterior a través de este punto final a otros destinos remotos después de la autenticación en un PC remoto. Así que no hay segundo salto. Para evitar el problema, hay pocas pero complicadas maneras o una que todo el mundo dirá ahora, \"Oh Dios mío, no hagas eso\", pero voy a lanzarla ahí fuera."
    },
    "Die Lösung ist, CredSSP nur temporär als Punkt-zu-Punkt-Verbindung zu nutzen und nach dem Deployment wieder zu entschärfen. Es sollte unter keinen Umständen unternehmensweit erlaubt werden.": {
        "__active__": true,
        "es": "La solución es utilizar CredSSP sólo temporalmente como una conexión punto a punto y desactivarlo de nuevo después del despliegue. Bajo ninguna circunstancia debe permitirse en toda la empresa."
    },
    "CredSSP hat keinen Single-Hop-Zwang. Authentifizierungen können in einer CredSSP-Sitzung weiterverwendet werden. Sollte das unternehmensweit und dauerhaft erlaubt werden, kann das zu erheblichen Sicherheitsproblemen führen.": {
        "__active__": true,
        "es": "CredSSP no tiene restricciones de salto único. Las autenticaciones pueden seguir utilizándose en una sesión CredSSP. Si esto se permite en toda la empresa y de forma permanente, puede dar lugar a problemas de seguridad considerables."
    },
    "Hier nun das Skript für alle, die vor dem selben Problem stehen.": {
        "__active__": true,
        "es": "Aquí está el script para todos aquellos que se enfrentan al mismo problema."
    },
    "Das hier beschriebene Skript ist bewusst flach gehalten, um es verständlich zu machen und den weiteren Ausbau durch Euch so einfach wie möglich zu gestalten.": {
        "__active__": true,
        "es": "La secuencia de comandos que aquí se describe es deliberadamente plana para facilitar su comprensión y para que usted pueda ampliarla de la forma más sencilla posible."
    },
    "Bitte beachten Sie, dass in diesem Beispiel CredSSP nur temporär verwendet wird und nach dem Deployment wieder deaktiviert wird. Zudem wird ausschließlich der angegebene Remote-Computer delegiert und nicht das gesamte Netzwerk.": {
        "__active__": true,
        "es": "Tenga en cuenta que CredSSP sólo se utiliza temporalmente en este ejemplo y se desactiva de nuevo después de la implementación. Además, sólo se delega el equipo remoto especificado y no toda la red."
    },
    "Nach gründlicher Validierung hat sich dieser Ansatz als sicherer und einfacher Weg erwiesen, um das gewünschte Ziel zu erreichen.": {
        "__active__": true,
        "es": "Tras una validación exhaustiva, este enfoque ha demostrado ser una forma segura y sencilla de lograr el objetivo deseado."
    },
    "Dieses Skript muss mit administrativen Rechten ausgeführt werden, um die CredSSP-Authentifizierung zu aktivieren und zu deaktivieren.": {
        "__active__": true,
        "es": "Este script debe ejecutarse con derechos administrativos para activar y desactivar la autenticación CredSSP."
    },
    "Das Skript kann entweder mit Parametern aufgerufen werden, oder Sie tragen Ihre spezifischen Werte direkt ein. Die notwendigen Informationen für den Installer und die Argumente finden Sie nach der Image-Erstellung im entsprechenden Installations-Skript. Ein typischer Name für eine Revit-Installation könnte beispielsweise `Install Autodesk Revit 2024.bat` sein.": {
        "__active__": true,
        "es": "El script puede ser llamado con parámetros o puede introducir directamente sus valores específicos. La información necesaria para el instalador y los argumentos se encuentran en el script de instalación correspondiente una vez creada la imagen. Un nombre típico para una instalación de Revit podría ser 'Instalar Autodesk Revit 2024.bat', por ejemplo."
    },
    "Die Parameter für die Silent-Installation und Deinstallation sind ebenfalls dort hinterlegt. Diese Parameter ermöglichen eine unbeaufsichtigte Installation bzw. Deinstallation der Software, was besonders in großen IT-Umgebungen von Vorteil ist.": {
        "__active__": true,
        "es": "Los parámetros de instalación y desinstalación silenciosa también se almacenan allí. Estos parámetros permiten instalar y desinstalar el software sin supervisión, lo que resulta especialmente ventajoso en entornos informáticos de gran tamaño."
    },
    "Für weitere Details und eine ausführliche Anleitung zur Bereitstellung von Autodesk-Software, besuchen Sie bitte den folgenden Artikel:": {
        "__active__": true,
        "es": "Para obtener más información e instrucciones detalladas sobre cómo implantar el software de Autodesk, visite el siguiente artículo:"
    },
    "Um eine PowerShell-Sitzung unter Verwendung von CredSSP zu starten, benötigen wir die Anmeldeinformationen eines Benutzers mit den erforderlichen Rechten zur Durchführung von Installationen. In den meisten Fällen handelt es sich dabei um den Domain-Admin. Ein Dialogfeld wird angezeigt, in dem Sie die Anmeldeinformationen eingeben können.": {
        "__active__": true,
        "es": "Para iniciar una sesión PowerShell utilizando CredSSP, necesitamos las credenciales de un usuario con los derechos necesarios para realizar instalaciones. En la mayoría de los casos, se trata del administrador del dominio. Aparece un cuadro de diálogo en el que puede introducir la información de inicio de sesión."
    },
    "Hier wird CredSSP sowohl auf dem Client als auch auf dem Server aktiviert. Es ist hilfreich, die Begriffe \"Verteiler\" (Client) und \"Empfänger\" (Server) zu verwenden, um die Rollen klarer zu definieren. Der Try-Block umfasst alle potenziell fehleranfälligen Aktionen und kann nach Belieben angepasst werden. Für den Anfang ist diese Struktur einfach und robust.": {
        "__active__": true,
        "es": "Aquí CredSSP se activa tanto en el cliente como en el servidor. Es útil utilizar los términos \"distribuidor\" (cliente) y \"destinatario\" (servidor) para definir los roles con mayor claridad. El bloque try incluye todas las acciones potencialmente propensas a errores y puede personalizarse según sea necesario. Para empezar, esta estructura es sencilla y robusta."
    },
    "Hier wird eine neue PowerShell-Sitzung mit CredSSP-Authentifizierung erstellt.": {
        "__active__": true,
        "es": "Aquí se crea una nueva sesión PowerShell con autenticación CredSSP."
    },
    "Hier wird das Skript auf dem Remote-Computer ausgeführt. Der Name, der Installer und die Argumente werden als Parameter übergeben. An dieser Stelle endet der Try-Block.": {
        "__active__": true,
        "es": "Aquí, el script se ejecuta en el ordenador remoto. El nombre, el instalador y los argumentos se pasan como parámetros. El bloque try termina en este punto."
    },
    "Im Finally-Block wird die PowerShell-Sitzung geschlossen und CredSSP auf dem Server und Client deaktiviert. Der Finally-Block wird immer ausgeführt, unabhängig davon, ob der Try-Block erfolgreich war oder nicht. Bitte beachten Sie, dass das Abfangen von Fehlern auch über einen möglichen Exception-Block erfolgen kann. Dies überlasse ich dem findigen Leser.": {
        "__active__": true,
        "es": "El bloque Finally cierra la sesión PowerShell y desactiva CredSSP en el servidor y en el cliente. El bloque Finally siempre se ejecuta, independientemente de si el bloque Try tuvo éxito o no. Tenga en cuenta que los errores también se pueden interceptar mediante un posible bloque de excepción. Dejo esto al lector ingenioso."
    },
    "Dieses Skript dient mir nun selbst als Grundlage für Erweiterungen. Ich werde nun daran arbeiten, ein übergeordnetes Skript zu entwickeln, um die Installationen in großen Mengen zu steuern und zu überwachen.": {
        "__active__": true,
        "es": "Este script sirve ahora de base para mis propias ampliaciones. Ahora trabajaré en el desarrollo de un script superordinado para controlar y supervisar las instalaciones en grandes cantidades."
    },
    "Quellangaben": {
        "__active__": true,
        "es": "Fuente de información"
    }
}