{
    "Um das Plugin zu verwenden, müssen Sie es zuerst installieren. Führen Sie dazu den folgenden Befehl aus:": {
        "__active__": true,
        "en-us": "To use the plugin, you must first install it. To do this, execute the following command:"
    },
    "Lasst uns Anfangen": {
        "__active__": true,
        "en-us": "Let's get started"
    },
    "Nachdem Sie die Konfiguration vorgenommen haben, können Sie die Übersetzungsfunktionen in Ihren Markdown-Dateien verwenden.": {
        "__active__": true,
        "en-us": "Once you have made the configuration, you can use the translation functions in your Markdown files."
    },
    "Viel Spaß beim Übersetzen!": {
        "__active__": true,
        "en-us": "Have fun translating!"
    },
    "Installation des Plugins": {
        "__active__": true,
        "en-us": "Installation of the plugin"
    },
    "Api-Key bereitstellen": {
        "__active__": true,
        "en-us": "Provide Api key"
    },
    "Konfiguration des Plugins": {
        "__active__": true,
        "en-us": "Configuration of the plugin"
    },
    "Ersetzen Sie <code>DEEPL-API-KEY</code> durch Ihren eigenen Api-Key.": {
        "__active__": true,
        "en-us": "Replace <code>DEEPL-API-KEY</code> with your own api key."
    },
    "Nachdem Sie den Api-Key erstellt haben, erstellen Sie eine Datei namens <code>auth_key.json</code> im Wurzelverzeichnis Ihres Projekts und fügen folgenden Inhalt ein:": {
        "__active__": true,
        "en-us": "After you have created the api key, create a file called <code>auth_key.json</code> in the root directory of your project and add the following content:"
    },
    "Das Plugin ist noch in der Entwicklung und es wird empfohlen, die Dokumentation zu lesen, um die Funktionalitäten und Einschränkungen zu verstehen. Ich bitte auch alle Anforderungen und Änderungsvoschlage in den Github-Issues zu melden.": {
        "__active__": true,
        "en-us": "The plugin is still under development and it is recommended to read the documentation to understand the functionalities and limitations. I also ask you to report all requirements and change proposals in the Github issues."
    },
    "<strong>Aber es ist nicht ausgeschlossen, dass auch andere Plugins funktionieren.</strong>": {
        "__active__": true,
        "en-us": "<strong>But it is not impossible that other plugins will also work.</strong>"
    },
    "Diese großartigen Plugins benötigen definitiv volle Unterstützung und Anerkennung.": {
        "__active__": true,
        "en-us": "These great plugins definitely need full support and recognition."
    },
    "Diese Auflistung sind die Plugins die bei der Entwicklung von Langly direkt verwendet wurden.": {
        "__active__": true,
        "en-us": "This list contains the plugins that were used directly in the development of Langly."
    },
    "Das Langly-Plugin für MkDocs ist ein Plugin, das Sprachunterstützung und Übersetzungen für Webseiten bietet, die mit MkDocs in verwendung des Material-Themes erstellt wurden. Es ermöglicht die einfache Verwaltung mehrsprachiger Inhalte und die automatische Übersetzung von Texten, um eine breitere Zielgruppe zu erreichen. Es erfüllt bewusst keine der derezitigen Übersetzungsstandards sondern geht einen ganz eigenen aber offenen Weg.": {
        "__active__": true,
        "en-us": "The Langly plugin for MkDocs is a plugin that provides language support and translations for websites created with MkDocs using the Material theme. It allows easy management of multilingual content and automatic translation of texts to reach a wider audience. It deliberately does not comply with any of the current translation standards but takes a completely unique but open approach."
    },
    "Diese Plugin wurde für Verwendung des großartigen Material-Themes erstellt und bietet Funktionalitäten um z.B. auch den Blogbereich zu Internationalisieren.": {
        "__active__": true,
        "en-us": "This plugin was created to use the great Material theme and offers functionalities to e.g. internationalize the blog area."
    },
    "<strong>Bitte lesen sie diesen Abschnitt sorgfältig durch und beachten Sie den Api-Key in der .gitignore auszuschließen und auch auf jede erdenkliche Weise vor dem Upload ins Internet zu schützen.</strong>": {
        "__active__": true,
        "en-us": "<strong>Please read this section carefully and be sure to exclude the Api key in the .gitignore and also protect it in every possible way from being uploaded to the Internet.</strong>"
    },
    "Um das Plugin zu verwenden, benötigen Sie einen Deepl-Api-Key. Sie können diesen kostenlosen von der Deepl-Website erhalten.": {
        "__active__": true,
        "en-us": "To use the plugin, you need a Deepl API key. You can obtain this free of charge from the Deepl website."
    },
    "<strong>Öffnen Sie die Datei .gitignore und fügen Sie die Zeile <code>auth_key.json</code> hinzu, um zu verhindern, dass die Datei versehentlich hochgeladen wird.</strong>": {
        "__active__": true,
        "en-us": "<strong>Open the .gitignore file and add the line <code>auth_key.json</code> to prevent the file from being uploaded by mistake.</strong>"
    },
    "Nach der Installation können Sie das Plugin in Ihrer <code>mkdocs.yml</code>-Konfigurationsdatei aktivieren.": {
        "__active__": true,
        "en-us": "After installation, you can activate the plugin in your <code>mkdocs.yml</code>."
    },
    "In dieser Konfiguration wird die Sprache Deutsch als Quellsprache und Englisch als Zielsprache festgelegt. Sie können beliebig viele Zielsprachen hinzufügen. Allerdings beeinträchtig das die `serve' Performance um so mehr": {
        "__active__": true,
        "en-us": "In this configuration, German is set as the source language and English as the target language. You can add as many target languages as you like. However, this affects the `serve' performance all the more"
    },
    "Verwendung des Plugins": {
        "__active__": true,
        "en-us": "Using the plugin"
    },
    "<strong>Es werden im vorliegenden Entwicklungstand auch keine anderen Themen unterstützt. Die derzeit einzige Übersetzungsengine ist Deepl und es wird ein deepl-Api-Key benötigt, um das Plugin zu verwenden.</strong>": {
        "__active__": true,
        "en-us": "<strong>No other themes are supported in the current state of development. The only translation engine currently available is Deepl and a deepl api key is required to use the plugin.</strong>"
    },
    "Ein paar einfache Beispiele": {
        "__active__": true,
        "en-us": "A few simple examples"
    },
    "<code>[[</code>Dieser Text repräsentiert Ihre Quellsprache<code>]]</code>": {
        "__active__": true,
        "en-us": "<code>[[</code>This text represents your source language<code>]]</code>"
    },
    "Das Plugin analysiert markdown Texte und wertet maskierte Textpassagen aus, die mit <code>[[</code> und <code>]]</code> umschlossen sind. Diese <code>delimiter</code> werden beim rendern der Seite entfernt und Quell sowie Zielsprache werden korekt auf Ihrer Seite dargestellt.": {
        "__active__": true,
        "en-us": "The plugin analyzes markdown texts and evaluates masked text passages that are enclosed with <code>[[</code> and <code>]]</code>. These <code>delimiter</code> are removed when the page is rendered and the source and target language are displayed correctly on your page."
    },
    "Satz": {
        "__active__": true,
        "en-us": "Set"
    },
    "Absatz": {
        "__active__": true,
        "en-us": "Paragraph"
    },
    "Gehen sie wie folgt vor um Texte zu maskieren": {
        "__active__": true,
        "en-us": "Proceed as follows to mask texts"
    },
    "<code>[[</code>Ihr Text<code>]]</code>": {
        "__active__": true,
        "en-us": "<code>[[</code>Your text<code>]]</code>"
    },
    "Aufzählung mit Doppelpunkt": {
        "__active__": true,
        "en-us": "Enumeration with colon"
    },
    "Satz in dem der Delimiter vorkommt": {
        "__active__": true,
        "en-us": "Record in which the delimiter occurs"
    },
    "Feedback und Unterstützung": {
        "__active__": true,
        "en-us": "Feedback and support"
    },
    "Ich freue mich über jede Art von Feedback und Unterstützung.": {
        "__active__": true,
        "en-us": "I am happy to receive any kind of feedback and support."
    },
    "Vielen Dank für Ihr Interesse an diesem Plugin!": {
        "__active__": true,
        "en-us": "Thank you for your interest in this plugin!"
    },
    "<code>[[</code>Dieser Absatz enthält mehrere Sätze in Ihrer Quellsprache. Es ist die empfohlene Art der Maskierung von Textpassagen und liefert Deepl mehr Kontext um eine bessere Übersetzung zu liefern.<code>]]</code>": {
        "__active__": true,
        "en-us": "<code>[[</code>This paragraph contains several sentences in your source language. It is the recommended way of masking text passages and provides Deepl with more context to deliver a better translation.]"
    },
    "Der Text innerhalb der Maskierung wird dann von Langly übersetzt automatisch Übersetzt.": {
        "__active__": true,
        "en-us": "The text within the masking is then automatically translated by Langly."
    },
    "Umschließen sie den öffnenden und schließenden Delimiter mit <strong>`</strong>": {
        "__active__": true,
        "en-us": "Enclose the opening and closing delimiter with <strong>`</strong>"
    },
    "<code>[[</code>Wert nach dem Doppelpunkt<code>]]</code>": {
        "__active__": true,
        "en-us": "<code>[[</code>value after the colon<code>]]</code>"
    },
    "<code>[[</code>Aufzählung<code>]]</code>": {
        "__active__": true,
        "en-us": "<code>[[</code>enumeration<code>]]</code>"
    },
    "Ein deepl-Account wird benötigt (deepl im derzeitigen Stand die einzige unterstützte Übersetzungsengine)": {
        "__active__": true,
        "en-us": "A deepl account is required (deepl is currently the only supported translation engine)"
    },
    "Für den Anfang werden ein paar vorläufige Schritte benötigt, um das Plugin zu benutzen.": {
        "__active__": true,
        "en-us": "To get started, a few preliminary steps are required to use the plugin."
    },
    "mkdocs mit installiertem Material-Theme": {
        "__active__": true,
        "en-us": "mkdocs with installed material theme"
    },
    "Direkte unterstütze Plugins für mkdocs": {
        "__active__": true,
        "en-us": "Directly supported plugins for mkdocs"
    },
    "Wichtig ist dabei die deepl-Language-Codes für <code>source</code> und <code>target</code> zu verwenden. Diese sind auf folgender website zu finden:": {
        "__active__": true,
        "en-us": "It is important to use the deepl language codes for <code>source</code> and <code>target</code>. These can be found on the following website:"
    }
}