{
    "Das Langly-Plugin für MkDocs ist ein Plugin, das Sprachunterstützung und Übersetzungen für Webseiten bietet, die mit MkDocs in Verwendung des Material-Themes erstellt wurden. Es ermöglicht die einfache Verwaltung mehrsprachiger Inhalte und die automatische Übersetzung von Texten, um eine breitere Zielgruppe zu erreichen. Es erfüllt bewusst keine der derzeitigen Übersetzungsstandards, sondern geht einen ganz eigenen aber offenen Weg.": {
        "__active__": true,
        "en-us": "The Langly plugin for MkDocs is a plugin that provides language support and translations for websites created with MkDocs using the Material theme. It enables easy management of multilingual content and automatic translation of texts to reach a wider audience. It deliberately does not comply with any of the current translation standards, but takes a completely unique but open approach."
    },
    "Dieses Plugin wurde für Verwendung des großartigen Material-Themes erstellt und bietet Funktionalitäten um z.B. auch den Blogbereich zu Internationalisieren.": {
        "__active__": true,
        "en-us": "This plugin was created to use the great Material theme and offers functionalities to e.g. internationalize the blog area."
    },
    "<strong>Die derzeit einzige Übersetzungsengine ist Deepl und es wird ein DeepL-Api-Key benötigt, um das Plugin zu verwenden.</strong>": {
        "__active__": true,
        "en-us": "<strong>The only translation engine currently available is Deepl and a DeepL api key is required to use the plugin.</strong>"
    },
    "Direkte unterstütze Plugins für mkdocs": {
        "__active__": true,
        "en-us": "Directly supported plugins for mkdocs"
    },
    "Diese Auflistung sind Plugins, die bei der Entwicklung von Langly direkt verwendet wurden und als kompatibel gelten.": {
        "__active__": true,
        "en-us": "This list includes plugins that were used directly in the development of Langly and are considered compatible."
    },
    "<strong>Aber es ist nicht ausgeschlossen, dass auch andere Plugins funktionieren.</strong>": {
        "__active__": true,
        "en-us": "<strong>But it is not impossible that other plugins will also work.</strong>"
    },
    "Diese großartigen Plugins benötigen definitiv volle Unterstützung und Anerkennung.": {
        "__active__": true,
        "en-us": "These great plugins definitely need full support and recognition."
    },
    "Das Plugin ist noch in der Entwicklung und es wird empfohlen, die Dokumentation zu lesen, um die Funktionalitäten und Einschränkungen zu verstehen. Ich bitte auch alle Anforderungen und Änderungsvorschläge in den GitHub-Issues zu melden.": {
        "__active__": true,
        "en-us": "The plugin is still under development and it is recommended to read the documentation to understand the functionalities and limitations. I also ask you to report all requirements and suggested changes in the GitHub issues."
    },
    "Lasst uns Anfangen": {
        "__active__": true,
        "en-us": "Let's get started"
    },
    "Für den Anfang werden ein paar vorläufige Schritte benötigt, um das Plugin zu benutzen.": {
        "__active__": true,
        "en-us": "To get started, a few preliminary steps are required to use the plugin."
    },
    "mkdocs mit installiertem Material-Theme": {
        "__active__": true,
        "en-us": "mkdocs with installed material theme"
    },
    "Installation des Plugins": {
        "__active__": true,
        "en-us": "Installation of the plugin"
    },
    "Um das Plugin zu verwenden, müssen Sie es zuerst installieren. Führen Sie dazu den folgenden Befehl aus:": {
        "__active__": true,
        "en-us": "To use the plugin, you must first install it. To do this, execute the following command:"
    },
    "Api-Key bereitstellen": {
        "__active__": true,
        "en-us": "Provide Api key"
    },
    "Um das Plugin zu verwenden, benötigen Sie einen Deepl-Api-Key. Sie können diesen kostenlosen von der Deepl-Website erhalten.": {
        "__active__": true,
        "en-us": "To use the plugin, you need a Deepl API key. You can obtain this free of charge from the Deepl website."
    },
    "Nachdem Sie den Api-Key erstellt haben, erstellen Sie eine Datei namens <code>auth_key.json</code> im Wurzelverzeichnis Ihres Projekts und fügen folgenden Inhalt ein:": {
        "__active__": true,
        "en-us": "After you have created the api key, create a file called <code>auth_key.json</code> in the root directory of your project and add the following content:"
    },
    "Ersetzen Sie <code>DEEPL-API-KEY</code> durch Ihren eigenen Api-Key.": {
        "__active__": true,
        "en-us": "Replace <code>DEEPL-API-KEY</code> with your own api key."
    },
    "Api-Key schützen": {
        "__active__": true,
        "en-us": "Protect Api key"
    },
    "Bitte lesen Sie diesen Abschnitt sorgfältig durch und beachten Sie den Api-Key in der .gitignore auszuschließen und auch auf jede erdenkliche Weise vor dem Upload ins Internet zu schützen.": {
        "__active__": true,
        "en-us": "Please read this section carefully and be sure to exclude the Api key in the .gitignore and also protect it in every possible way from being uploaded to the Internet."
    },
    "Öffnen Sie die Datei .gitignore im Wurzelverzeichnis und fügen Sie die Zeile <code>auth_key.json</code> hinzu, um zu verhindern das die Datei versehentlich hochgeladen wird. Anschließend bitte auch online prüfen, dass der Key nicht im Repo zu finden ist.": {
        "__active__": true,
        "en-us": "Open the .gitignore file in the root directory and add the line <code>auth_key.json</code> to prevent the file from being uploaded by mistake. Then check online that the key cannot be found in the repo."
    },
    "Konfiguration des Plugins": {
        "__active__": true,
        "en-us": "Configuration of the plugin"
    },
    "Nach der Installation können Sie das Plugin in Ihrer <code>mkdocs.yml</code>-Konfigurationsdatei aktivieren. <strong>Langly sollte dabei als letztes Plugin in der Liste stehen</strong>.": {
        "__active__": true,
        "en-us": "After installation, you can activate the plugin in your <code>mkdocs.yml</code>. <strong>Langly should be the last plugin in the list</strong>."
    },
    "Es müssen keine sprachbezogenen Einstellungen am Material-Theme vorgenommen werden. Das bedeutet das die Optionen <code>theme&gt;language</code> und <code>extra&gt;alternate</code> durch das Plugin gesetzt werden.": {
        "__active__": true,
        "en-us": "No language-related settings need to be made in the Material theme. This means that the <code>theme&gt;language</code> and <code>extra&gt;alternate</code> options are set by the plugin."
    },
    "In dieser Konfiguration wird die Sprache Deutsch als Quellsprache und Englisch als Zielsprache festgelegt. Sie können beliebig viele Zielsprachen hinzufügen. Allerdings beeinträchtigt das die <code>serve</code> Performance um so mehr. Die Option  <code>site_url</code> sollte der Veröffentlichungsadresse Ihrer Website entsprechen damit die <code>sitemap</code> und <code>canonicals</code> korrekt funktionieren.": {
        "__active__": true,
        "en-us": "In this configuration, German is set as the source language and English as the target language. You can add as many target languages as you like. However, this will affect the <code>serve</code> performance all the more. The <code>site_url</code> option should correspond to the publication address of your website so that the <code>sitemap</code> and <code>canonicals</code> function correctly."
    },
    "Wichtig ist dabei die Deepl-Language-Codes für <code>source</code> und <code>target</code> zu verwenden. Diese sind auf folgender Website zu finden:": {
        "__active__": true,
        "en-us": "It is important to use the Deepl language codes for <code>source</code> and <code>target</code>. These can be found on the following website:"
    },
    "Nachdem Sie die Konfiguration vorgenommen haben, können Sie die Übersetzungsfunktionen in Ihren Markdown-Dateien verwenden.": {
        "__active__": true,
        "en-us": "Once you have made the configuration, you can use the translation functions in your Markdown files."
    },
    "Verwendung des Plugins": {
        "__active__": true,
        "en-us": "Using the plugin"
    },
    "Gehen sie wie folgt vor, um Texte zu maskieren": {
        "__active__": true,
        "en-us": "Proceed as follows to mask texts"
    },
    "Der Text innerhalb der Maskierung wird dann von Langly automatisch übersetzt.": {
        "__active__": true,
        "en-us": "The text within the masking is then automatically translated by Langly."
    },
    "Ein paar einfache Beispiele": {
        "__active__": true,
        "en-us": "A few simple examples"
    },
    "Satz": {
        "__active__": true,
        "en-us": "Set"
    },
    "Absatz": {
        "__active__": true,
        "en-us": "Paragraph"
    },
    "Aufzählung mit Doppelpunkt": {
        "__active__": true,
        "en-us": "Enumeration with colon"
    },
    "Einfügen einer \"index.html\" mit Umleitung zur Zielsprache nach Browsersprache.": {
        "__active__": true,
        "en-us": "Insert an \"index.html\" with redirection to the target language according to the browser language."
    },
    "Konfigurieren Sie MKDocs und das Materialthema für jedes Build in der jeweiligen Sprache.": {
        "__active__": true,
        "en-us": "Configure MKDocs and the material theme for each build in the respective language."
    },
    "Optionale Sprachumschaltung, die automatisch konfiguriert wird.": {
        "__active__": true,
        "en-us": "Optional language switching, which is configured automatically."
    },
    "Setzen aller offenen Übersetzungen während <code>serve</code> in den Draft-Mode, um den Zugriff auf die Übersetzungs-Api zu minimieren.": {
        "__active__": true,
        "en-us": "Set all open translations to draft mode during <code>serve</code> to minimize access to the translation api."
    },
    "Durchsuchen des Seiteninhaltes, um zusätzliche Übersetzungen zu finden, die mit Plugins von Drittanbietern wie <code>mkdocs-strings</code> erstellt wurden.": {
        "__active__": true,
        "en-us": "Browse page content to find additional translations created with third-party plugins such as <code>mkdocs-strings</code>."
    },
    "Speichern aller Übersetzungen in einer JSON-Datei pro Seite, um den Zugriff auf die Übersetzungs-Api zu minimieren und manuelle Änderungen zu ermöglichen.": {
        "__active__": true,
        "en-us": "Save all translations in one JSON file per page to minimize access to the translation api and allow manual changes."
    },
    "Konvertiert Markdown in HTML, übersetzt und konvertiert zurück, um Textformatierungen wie <code>code</code>, <code>strong</code> und <code>em</code> zu erhalten.": {
        "__active__": true,
        "en-us": "Converts Markdown to HTML, translates and converts back to get text formatting like <code>code</code>, <code>strong</code> and <code>em</code>."
    },
    "Fixe-Wörter in Code-Tags mit temporären HTML-Attributen erhalten.": {
        "__active__": true,
        "en-us": "Get fixe words in code tags with temporary HTML attributes."
    },
    "Übersetzung der Navigation": {
        "__active__": true,
        "en-us": "Navigation translation"
    },
    "Kopieren Sie die für gh-deploy erforderliche CNAME-Datei in das Stammverzeichnis des Build's.": {
        "__active__": true,
        "en-us": "Copy the CNAME file required for gh-deploy to the root directory of the build."
    },
    "<em>ERSETZT</em>": {
        "__active__": true,
        "en-us": "<em>REPLACED</em>"
    },
    "Feedback und Unterstützung": {
        "__active__": true,
        "en-us": "Feedback and support"
    },
    "Ich freue mich über jede Art von Feedback und Unterstützung.": {
        "__active__": true,
        "en-us": "I am happy to receive any kind of feedback and support."
    },
    "Vielen Dank für Ihr Interesse an diesem Plugin!": {
        "__active__": true,
        "en-us": "Thank you for your interest in this plugin!"
    },
    "Viel Spaß beim Übersetzen!": {
        "__active__": true,
        "en-us": "Have fun translating!"
    },
    "Aufzählung": {
        "__active__": true,
        "en-us": "Enumeration"
    },
    "Wert nach dem Doppelpunkt": {
        "__active__": true,
        "en-us": "Value after the colon"
    },
    "Dieser Absatz enthält mehrere Sätze in Ihrer Quellsprache. Es ist die empfohlene Art der Maskierung von Textpassagen und liefert Deepl mehr Kontext um eine bessere Übersetzung zu liefern.": {
        "__active__": true,
        "en-us": "This paragraph contains several sentences in your source language. It is the recommended way of masking text passages and provides Deepl with more context to deliver a better translation."
    },
    "Dieser Text repräsentiert Ihre Quellsprache": {
        "__active__": true,
        "en-us": "This text represents your source language"
    },
    "Ihr Text": {
        "__active__": true,
        "en-us": "Your text"
    },
    "Das Plugin analysiert Markdown-Texte und wertet maskierte Textpassagen aus, die mit <code>{[</code> und <code>]}</code> umschlossen sind. Diese <code>delimiter</code> werden beim Rendern der Seite entfernt und Quell sowie Zielsprache werden korrekt auf Ihrer Seite dargestellt.": {
        "__active__": true,
        "en-us": "The plugin analyzes Markdown texts and evaluates masked text passages that are enclosed with <code>{[</code> and <code>]}</code>. These <code>delimiter</code> are removed when the page is rendered and the source and target language are displayed correctly on your page."
    },
    "Da der Algorithmus die Zeichen <code>{[</code> und <code>]}</code> als Maskierung für übersetzbaren Text verwendet, können diese Zeichen nicht direkt im Text dokumentiert werden. Stattdessen werden <code>hints</code> verwendet, die nach der Übersetzung automatisch in <code>{[</code> und <code>]}</code> umgewandelt werden.": {
        "__active__": true,
        "en-us": "As the algorithm uses the characters <code>{[</code> and <code>]}</code> as masking for translatable text, these characters cannot be documented directly in the text. Instead, <code>hints</code> are used, which are automatically converted to <code>{[</code> and <code>]}</code> after translation."
    },
    "Begrenzungszeichen (z.B. <code>{[</code> und <code>]}</code>) innerhalb einer Maskierung ignorieren.": {
        "__active__": true,
        "en-us": "Ignore delimiters (e.g. <code>{[</code> and <code>]}</code>) within a masking."
    },
    "Markdown Export beim ersten durchlauf von <code>serve</code>, <code>build</code> oder <code>gh-deploy</code> für angegebene Seiten und Sprachen mit definiertem Pfad.": {
        "__active__": true,
        "en-us": "Markdown export on first run of <code>serve</code>, <code>build</code> or <code>gh-deploy</code> for specified pages and languages with defined path."
    },
    "Hier kommt gerade was neues": {
        "__active__": true,
        "en-us": "Here comes something new"
    },
    "Ein DeepL-Free-Account wird benötigt": {
        "__active__": true,
        "en-us": "A DeepL-Free-Account is required"
    }
}