{
    "Verteilung von Autodesk-Software mit ODIS-Installer und PowerShell unter Vermeidung des Double-Hop-Problems": {
        "__active__": true,
        "it": "Distribuzione del software Autodesk con il programma di installazione ODIS e PowerShell per evitare il problema del doppio hop"
    },
    "Seitdem Autodesk sein Deployment-System auf den ODIS-Installer umgestellt hat, laufen alle Verteilungen, die unbeaufsichtigt über den SYSTEM-Account ausgerollt werden, ohne Erfolgscode endlos weiter.": {
        "__active__": true,
        "it": "Da quando Autodesk ha sostituito il sistema di distribuzione con il programma di installazione ODIS, tutte le distribuzioni avviate senza supervisione tramite l'account SYSTEM continuano ad essere eseguite all'infinito senza codice di successo."
    },
    "Die genaue Fehlermeldung im ODIS-Log lautet:": {
        "__active__": true,
        "it": "Il messaggio di errore esatto nel registro ODIS è:"
    },
    "Nach einer Weile scheint der Installer-Dienst auch beendet zu werden, sendet aber keinen Exit-Code mehr.": {
        "__active__": true,
        "it": "Dopo un po', anche il servizio di installazione sembra essere terminato, ma non invia più un codice di uscita."
    },
    "Ich habe viele Deployment-Suiten ausprobiert, aber das Resultat ist immer dasselbe, wenn der SYSTEM-Account zum Einsatz kommt.": {
        "__active__": true,
        "it": "Ho provato molte suite di distribuzione, ma il risultato è sempre lo stesso quando viene utilizzato l'account SYSTEM."
    },
    "Um das Problem vorübergehend zu lösen, bis Autodesk das Problem erkennt und behebt, habe ich nun Lösungsansätze entwickelt, die mir hier bei der Arbeit Abhilfe verschaffen.": {
        "__active__": true,
        "it": "Per risolvere temporaneamente il problema fino a quando Autodesk non lo riconosce e lo risolve, ho sviluppato delle soluzioni che mi aiutano qui al lavoro."
    },
    "Mein geplanter Ansatz war, die Verteilung über PowerShell zu realisieren, aber dabei stieß ich erneut auf eine weitere Hürde, die die Kerberos-Authentifizierung mit sich bringt: das sogenannte Double-Hop-Problem, da meine Softwarepakete in CIFS-Freigaben lagern.": {
        "__active__": true,
        "it": "Il mio approccio previsto era quello di realizzare la distribuzione tramite PowerShell, ma mi sono scontrato con un altro ostacolo che l'autenticazione Kerberos porta con sé: il cosiddetto problema del doppio hop, poiché i miei pacchetti software sono archiviati in condivisioni CIFS."
    },
    "Kerberos lässt es nicht zu, dass nach einer Authentifizierung auf einem Remote-PC eine weitere Authentifizierung über diesen Endpunkt zu anderen entfernten Zielen durchgeführt wird. Es gibt also keinen zweiten Hop. Um das Problem zu umgehen, gibt es wenige, aber komplizierte Wege oder einen, bei dem jetzt alle sagen werden: \"Oh mein Gott, tu das nicht\", aber ich hau es einfach mal raus.": {
        "__active__": true,
        "it": "Kerberos non consente di effettuare ulteriori autenticazioni attraverso questo endpoint verso altre destinazioni remote dopo l'autenticazione su un PC remoto. Quindi non c'è un secondo hop. Per aggirare il problema, ci sono pochi modi, ma complicati, o uno che ora tutti diranno: \"Oh mio Dio, non farlo\", ma io lo butto lì."
    },
    "Die Lösung ist, CredSSP nur temporär als Punkt-zu-Punkt-Verbindung zu nutzen und nach dem Deployment wieder zu entschärfen. Es sollte unter keinen Umständen unternehmensweit erlaubt werden.": {
        "__active__": true,
        "it": "La soluzione è utilizzare CredSSP solo temporaneamente come connessione punto-punto e disattivarlo nuovamente dopo l'implementazione. In nessun caso deve essere consentito a livello aziendale."
    },
    "CredSSP hat keinen Single-Hop-Zwang. Authentifizierungen können in einer CredSSP-Sitzung weiterverwendet werden. Sollte das unternehmensweit und dauerhaft erlaubt werden, kann das zu erheblichen Sicherheitsproblemen führen.": {
        "__active__": true,
        "it": "CredSSP non ha vincoli di single-hop. Le autenticazioni possono continuare a essere utilizzate in una sessione CredSSP. Se ciò è consentito a livello aziendale e in modo permanente, può comportare notevoli problemi di sicurezza."
    },
    "Hier nun das Skript für alle, die vor dem selben Problem stehen.": {
        "__active__": true,
        "it": "Ecco lo script per tutti coloro che stanno affrontando lo stesso problema."
    },
    "Das hier beschriebene Skript ist bewusst flach gehalten, um es verständlich zu machen und den weiteren Ausbau durch Euch so einfach wie möglich zu gestalten.": {
        "__active__": true,
        "it": "Lo script qui descritto è volutamente piatto per renderlo facilmente comprensibile e per semplificarne l'ulteriore espansione da parte dell'utente."
    },
    "Bitte beachten Sie, dass in diesem Beispiel CredSSP nur temporär verwendet wird und nach dem Deployment wieder deaktiviert wird. Zudem wird ausschließlich der angegebene Remote-Computer delegiert und nicht das gesamte Netzwerk.": {
        "__active__": true,
        "it": "Si noti che CredSSP è utilizzato solo temporaneamente in questo esempio e viene nuovamente disattivato dopo la distribuzione. Inoltre, viene delegato solo il computer remoto specificato e non l'intera rete."
    },
    "Nach gründlicher Validierung hat sich dieser Ansatz als sicherer und einfacher Weg erwiesen, um das gewünschte Ziel zu erreichen.": {
        "__active__": true,
        "it": "Dopo un'accurata convalida, questo approccio ha dimostrato di essere un modo sicuro e semplice per raggiungere l'obiettivo desiderato."
    },
    "Dieses Skript muss mit administrativen Rechten ausgeführt werden, um die CredSSP-Authentifizierung zu aktivieren und zu deaktivieren.": {
        "__active__": true,
        "it": "Questo script deve essere eseguito con diritti amministrativi per attivare e disattivare l'autenticazione CredSSP."
    },
    "Das Skript kann entweder mit Parametern aufgerufen werden, oder Sie tragen Ihre spezifischen Werte direkt ein. Die notwendigen Informationen für den Installer und die Argumente finden Sie nach der Image-Erstellung im entsprechenden Installations-Skript. Ein typischer Name für eine Revit-Installation könnte beispielsweise `Install Autodesk Revit 2024.bat` sein.": {
        "__active__": true,
        "it": "Lo script può essere richiamato con dei parametri oppure si possono inserire direttamente i valori specifici. Le informazioni necessarie per il programma di installazione e gli argomenti si trovano nello script di installazione corrispondente dopo la creazione dell'immagine. Un nome tipico per un'installazione di Revit potrebbe essere, ad esempio, 'Install Autodesk Revit 2024.bat'."
    },
    "Die Parameter für die Silent-Installation und Deinstallation sind ebenfalls dort hinterlegt. Diese Parameter ermöglichen eine unbeaufsichtigte Installation bzw. Deinstallation der Software, was besonders in großen IT-Umgebungen von Vorteil ist.": {
        "__active__": true,
        "it": "Vi sono memorizzati anche i parametri per l'installazione e la disinstallazione silenziose. Questi parametri consentono l'installazione e la disinstallazione non presidiata del software, il che è particolarmente vantaggioso in ambienti IT di grandi dimensioni."
    },
    "Für weitere Details und eine ausführliche Anleitung zur Bereitstellung von Autodesk-Software, besuchen Sie bitte den folgenden Artikel:": {
        "__active__": true,
        "it": "Per maggiori dettagli e una guida dettagliata alla distribuzione del software Autodesk, visitate il seguente articolo:"
    },
    "Um eine PowerShell-Sitzung unter Verwendung von CredSSP zu starten, benötigen wir die Anmeldeinformationen eines Benutzers mit den erforderlichen Rechten zur Durchführung von Installationen. In den meisten Fällen handelt es sich dabei um den Domain-Admin. Ein Dialogfeld wird angezeigt, in dem Sie die Anmeldeinformationen eingeben können.": {
        "__active__": true,
        "it": "Per avviare una sessione PowerShell utilizzando CredSSP, è necessario disporre delle credenziali di un utente con i diritti necessari per eseguire le installazioni. Nella maggior parte dei casi, si tratta dell'amministratore del dominio. Viene visualizzata una finestra di dialogo in cui è possibile inserire le informazioni di accesso."
    },
    "Hier wird CredSSP sowohl auf dem Client als auch auf dem Server aktiviert. Es ist hilfreich, die Begriffe \"Verteiler\" (Client) und \"Empfänger\" (Server) zu verwenden, um die Rollen klarer zu definieren. Der Try-Block umfasst alle potenziell fehleranfälligen Aktionen und kann nach Belieben angepasst werden. Für den Anfang ist diese Struktur einfach und robust.": {
        "__active__": true,
        "it": "In questo caso CredSSP è attivato sia sul client che sul server. È utile utilizzare i termini \"distributore\" (client) e \"destinatario\" (server) per definire meglio i ruoli. Il blocco try include tutte le azioni potenzialmente soggette a errore e può essere personalizzato a seconda delle esigenze. Per cominciare, questa struttura è semplice e robusta."
    },
    "Hier wird eine neue PowerShell-Sitzung mit CredSSP-Authentifizierung erstellt.": {
        "__active__": true,
        "it": "Qui viene creata una nuova sessione PowerShell con autenticazione CredSSP."
    },
    "Hier wird das Skript auf dem Remote-Computer ausgeführt. Der Name, der Installer und die Argumente werden als Parameter übergeben. An dieser Stelle endet der Try-Block.": {
        "__active__": true,
        "it": "In questo caso, lo script viene eseguito sul computer remoto. Il nome, il programma di installazione e gli argomenti vengono passati come parametri. Il blocco try termina a questo punto."
    },
    "Im Finally-Block wird die PowerShell-Sitzung geschlossen und CredSSP auf dem Server und Client deaktiviert. Der Finally-Block wird immer ausgeführt, unabhängig davon, ob der Try-Block erfolgreich war oder nicht. Bitte beachten Sie, dass das Abfangen von Fehlern auch über einen möglichen Exception-Block erfolgen kann. Dies überlasse ich dem findigen Leser.": {
        "__active__": true,
        "it": "Il blocco Finally chiude la sessione PowerShell e disattiva CredSSP sul server e sul client. Il blocco Finally viene sempre eseguito, indipendentemente dal successo o meno del blocco Try. Si noti che gli errori possono essere intercettati anche tramite un eventuale blocco exception. Lascio questo compito al lettore più intraprendente."
    },
    "Dieses Skript dient mir nun selbst als Grundlage für Erweiterungen. Ich werde nun daran arbeiten, ein übergeordnetes Skript zu entwickeln, um die Installationen in großen Mengen zu steuern und zu überwachen.": {
        "__active__": true,
        "it": "Questo script serve ora come base per le mie estensioni. Ora lavorerò allo sviluppo di uno script sovraordinato per controllare e monitorare le installazioni in grandi quantità."
    },
    "Quellangaben": {
        "__active__": true,
        "it": "Informazioni sulla fonte"
    }
}